Autodesk.Revit.DB.ExternalGeometryId.IsValidExternalGeometryId(System.String)
Checks whether a given string represents a valid ExternalGeometryId or not.
Remarks:
Any non-empty string is a valid ExternalGeometryId.
externalGeometryId:
A string that represents an identifier for an external geometry.
Returns:
True if the string represents a valid ExternalGeometryId, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ExternalGeometryId.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExternalGeometryId.Id
External geometry identifier.
Since:
2022

Autodesk.Revit.DB.ExternalGeometryId.GetHashCode
Gets the hash code.

Autodesk.Revit.DB.ExternalGeometryId.Equals(System.Object)
Determines whether the specified System.Object is equal to the current System.Object.
obj:  Another object.

Autodesk.Revit.DB.ExternalGeometryId.op_Inequality(Autodesk.Revit.DB.ExternalGeometryId,Autodesk.Revit.DB.ExternalGeometryId)
Determines whether two ExternalGeometryIds are different.
first: The first ExternalGeometryId.
second: The second ExternalGeometryId.
Returns: True if the ExternalGeometryIds are different; otherwise, false.

Autodesk.Revit.DB.ExternalGeometryId.op_Equality(Autodesk.Revit.DB.ExternalGeometryId,Autodesk.Revit.DB.ExternalGeometryId)
Determines whether two ExternalGeometryIds are the same.
first: The first ExternalGeometryId.
second: The second ExternalGeometryId.
Returns: True if the ExternalGeometryIds are the same; otherwise, false.

Autodesk.Revit.DB.ExternalGeometryId.#ctor(System.String)
Constructs an ExternalGeometryId object holding the given external geometry identifier.
externalGeometryId:
A string that represents an identifier for an external geometry.
Throws Autodesk.Revit.Exceptions.ArgumentException:
externalGeometryId is not a valid ExternalGeometryId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ExternalGeometryId
This class represents an identifier for geometry from external sources.
Since:
2022